// Технологично училище "Електронни системи" към Технически университет - София (www.elsys-bg.org)
// 11 А клас
// Номер 2
// Антон Андреев Митков
// Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х. Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се намери второто число N' в интервала [0; +∞) делящо се на x. Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.

#include <stdio.h>
#include <math.h>


main()
{
       float x;
       int arr[10];
       int broqch=0; 
       float p=0;
       float n=1;
       	int y;
	    int y1;
       int s=0;
       
       	do{
		printf("x=");
		scanf("%f", &x);
	}while( x>10);
	
	        	while(broqch<=10){
                        p=n/x;
                        if (fmod(p, 1) == 0){
					for(y=0; y<=n; y++){
						s=s+y;            //broqch za masiva
						
                                       }
    	           			 arr[broqch]=s;     //zapish v masiva
					broqch++;
					y1=arr[broqch-1];
					s=s-y1;      
                                            }           
                                  n++;
				  y=0;
                                  
                                  
                                  }
	        
	for(broqch=0; broqch<=10; broqch++){
	printf("%d ", arr[broqch]);
			}
	
    while(1);   
}
