// Технологично училище "Електронни системи" към Технически университет - София (www.elsys-bg.org)
// 11 А клас
// Номер 2
// Антон Андреев Митков
// Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 100 целочислени елемента. Стойностите на елементите да са случайни числа в интервала [0, 100). Елементите на масива да се подредят така, че числата завършващи на x да са в началото.

#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main()
{
       int arr[100];
       int x;
       int y;
       int broq;
       int i;
       int bonus = 0;
       printf("x= ");
       scanf("%d",&x);
       if(x<10){
               for(i=0; i<=100; i++){
           arr[i]=rand()%100;
                                     }     
               
   for (broq = 0; broq < arr[100] ; ++broq ){
             if (arr[broq]% 10 == x){
              
               
                    y = arr[bonus];
                    arr[bonus] = arr[broq];
                    arr[broq] = y;
                    bonus++;
              
                }
               }
                for(i=0; i<=100; i++){
                        printf("%d element : %d\n", i+1, arr[i]);
               }
               while(1);
}
}
