// Технологично училище "Електронни системи" към Технически университет - София (www.elsys-bg.org)
// 11 А клас
// Номер 2
// Антон Андреев Митков
// Да се разработи програма, която изисква от потребителя да въведе число x, където 0<x<1. Да се намери числото пи чрез следното развитие в ред:
// 4-4/3+4/5-4/7+4/9-4/11+...4/N. Развитието в ред спира при 4/N<x. Получената стойност за пи да се изведе на екрана.

#include <iostream>

int main(){
      float x;
      int i;
      float n=3.0f;
      float pi=4.0f;
      int pr=1;
      int br=0;
      
     	do{
		printf("x=");
		scanf("%f", &x);
	}while( x > 0 && x > 1 );
                         
             while((4/n)>=x){
			if(br<pr){
				pi = pi-(4.0/n);
				br++;
				n=n+2.0;
			}
			if(br==pr){
				pi = pi+(4.0/n);
				pr++;
				n=n+2.0;
			}
		}
		printf("%f ", pi);
       while(1);
       }
